{
  "tutorial": [
    {
      "name": "Game Introduction",
      "img-url": "/t1.png",
      "caption": "Welcome to Balance-Life-Decide! Your goal is to navigate life's journey, making decisions that lead to the best possible outcomes. Balance various aspects of your character's life to reach the end with fulfillment and success.",
      "dilemma": "Ready to explore the character's status? Click any button below to continue.",
      "physical-modifier": 0,
      "mental-modifier": 0,
      "education-modifier": 0,
      "career-modifier": 0
    },
    {
      "name": "Status",
      "img-url": "/t2.png",
      "caption": "As you progress through the game, your character's physical health, mental well-being, level of education, and career success, which are displayed at the top of the page, will be influenced by the decisions you make. Keep an eye on these status indicators to ensure a balanced and fulfilling life.",
      "dilemma": "Ready to explore the game's features? Click any button below to continue.",
      "physical-modifier": 0,
      "mental-modifier": 0,
      "education-modifier": 0,
      "career-modifier": 0
    },
    {
      "name": "Features",
      "img-url": "/t3.png",
      "caption": "As you progress, you'll encounter various scenarios related to your character's life. Each scenario presents a dilemma that you must navigate through decision-making.",
      "dilemma": "Ready to start your journey? Click any button below to continue.",
      "physical-modifier": 0,
      "mental-modifier": 0,
      "education-modifier": 0,
      "career-modifier": 0
    }
  ],
  "ending": [
    {
      "name": "Ending",
      "img-url": "/ending.png",
      "caption": "Congratulations, you've reached the end of the game!",
      "dilemna": "You've completed your character's journey. Would you like to restart the game and explore different paths, or return to the main page?",
      "physical-modifier": 0,
      "mental-modifier": 0,
      "education-modifier": 0,
      "career-modifier": 0
    }
  ],
  "scenarios": [
    {
      "name": "New Job",
      "img-url": "/joboffer.png",
      "caption": "An employeer has been impressed with your resume and wants to offer you a position at his company. This job offers increased pay but with a larger workload.",
      "dilemna": "Do you accept the job offer?",
      "physical-modifier": -1,
      "mental-modifier": -1,
      "education-modifier": -1,
      "career-modifier": 3
    },
    {
      "name": "Quitting Job",
      "img-url": "/quitjob.png",
      "caption": "Your employeer has been working you to the bone these past few months. This has caused you to feel tired and stressed more often but quitting will leave you jobless",
      "dilemna": "Do you quit your job?",
      "physical-modifier": 1,
      "mental-modifier": 2,
      "education-modifier": -1,
      "career-modifier": -2
    },
    {
      "name": "Pursuing a Degree at University",
      "img-url": "/goingtouni.png",
      "caption": "You are lucky enough to have the oppurtunity to enroll at the University of Balance. You will learn a lot but it will also cost a lot of money and time",
      "dilemna": "Do you enroll?",
      "physical-modifier": -1,
      "mental-modifier": -2,
      "education-modifier": 5,
      "career-modifier": -2
    },
    {
      "name": "Dropping Out of University",
      "img-url": "/goingtouni.png",
      "caption": "The past few months you've spent studying at the University of Balance have felt off. The Stress of exams and lack of time for other activities is making you consider dropping out and pursuing a career without a degree instead.",
      "dilemna": "Do you drop out?",
      "physical-modifier": 1,
      "mental-modifier": 2,
      "education-modifier": -5,
      "career-modifier": 2
    },
    {
      "name": "Pursue Love",
      "img-url": "/relationshipstart.png",
      "caption": "You've just been shot... by cupid. Someone has caught your attention and you seem to have caught theirs.",
      "dilemna": "Do you Pursue this relationship further?",
      "physical-modifier": -1,
      "mental-modifier": 2,
      "education-modifier": -1,
      "career-modifier": -1
    },
    {
      "name": "Breakup",
      "img-url": "/breakup.png",
      "caption": "It's not them it's you. Something is missing that used to be there. Maybe you're different people or the sparks slowly dying but it's not the same. ",
      "dilemna": "Do you end the relationship?",
      "physical-modifier": -1,
      "mental-modifier": -2,
      "education-modifier": -1,
      "career-modifier": 3
    },
    {
      "name": "Feeling Sick",
      "img-url": "/gettingsick.png",
      "caption": "Achoo! Something must be going around. You don't usually get sick, but now you have a fever and a bad cough getting better may mean sometime off work.",
      "dilemna": "Do you take time to recover?",
      "physical-modifier": 3,
      "mental-modifier": 0,
      "education-modifier": -1,
      "career-modifier": -2
    },
    {
      "name": "Gym membership",
      "img-url": "/gym.png",
      "caption": "Maybe you've been watching a lot of sports or have more free time than usual, but you've been wanting to get more active. A gym membership will help you're physical and mental health but will take time away from your work.",
      "dilemna": "Pump some iron?",
      "physical-modifier": 30,
      "mental-modifier": 2,
      "education-modifier": -1,
      "career-modifier": -4
    },
    {
      "name": "Move to the City",
      "img-url": "/movingtocity.png",
      "caption": "You know your small town better than yourself and you're sick of it. You want to go out and explore what opportunities the world holds for you.",
      "dilemna": "Do you leave the countryside?",
      "physical-modifier": 1,
      "mental-modifier": -3,
      "education-modifier": -1,
      "career-modifier": 3
    },
    {
      "name": "Leave the City",
      "img-url": "/goingtocountry.png",
      "caption": "The buzzing and humming of the city might as well be the anthem of your day. It may be good for you to get away for a bit and enjoy some quite",
      "dilemna": "Do you leave the city?",
      "physical-modifier": -1,
      "mental-modifier": 3,
      "education-modifier": -1,
      "career-modifier": -3
    },
    {
      "name": "Soccer Game",
      "img-url": "/soccer.jpg",
      "caption": "Your daughter has a soccer tournament but your boss needs you to stay behind for an important project at work.",
      "dilemna": "Will you make it to her game?",
      "physical-modifier": 0,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": -1
    },
    {
      "name": "Homework to Do",
      "img-url": "/homework.jpg",
      "caption": "You've finished your homework. You know you could do a better job, but your friends are playing outside.",
      "dilemna": "Do you join them?",
      "physical-modifier": 2,
      "mental-modifier": 2,
      "education-modifier": -2,
      "career-modifier": -1
    },
    {
      "name": "Starting Golf as a Hobby",
      "img-url": "/golf.png",
      "caption": "Lately, you want to play golf as a hobby. However, starting golf as a hobby requires investing in clubs, lessons, and spending time practicing.",
      "dilemna": "Do you start golf as a new hobby?",
      "physical-modifier": 1,
      "mental-modifier": 1,
      "education-modifier": 0,
      "career-modifier": -1
    },
    {
      "name": "Starting a Family",
      "img-url": "/startingfamily.png",
      "caption": "You and your partner have been discussing starting a family. The idea of parenthood fills you with excitement and anticipation, but it also comes with significant responsibilities and changes to your lifestyle.",
      "dilemma": "Do you and your partner decide to start a family?",
      "physical-modifier": -2,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": 0
    },
    {
      "name": "Anniversary Celebration for Parents",
      "img-url": "/celebrateparents.png",
      "caption": "Planning a surprise anniversary celebration for your parents is both joyful and challenging. It requires careful coordination and secrecy.",
      "dilemma": "Will you organize this special event for them?",
      "physical-modifier": -1,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": 0
    },
    {
      "name": "Launching a Small Business",
      "img-url": "/launchingbusiness.png",
      "caption": "Launching a small business is an exciting venture that brings both opportunities and challenges. Are you ready to take the leap and pursue your entrepreneurial dreams?",
      "dilemma": "Are you ready to take the leap and pursue your entrepreneurial dreams?",
      "physical-modifier": -1,
      "mental-modifier": -1,
      "education-modifier": 0,
      "career-modifier": 2
    },
    {
      "name": "Teaching a Cooking Class",
      "img-url": "/cookingclass.png",
      "caption": "Teaching a cooking class at a community center is a rewarding opportunity to share your culinary skills with others. It requires dedication and preparation to inspire and educate your students.",
      "dilemma": "Do you take on the responsibility of teaching a cooking class?",
      "physical-modifier": -2,
      "mental-modifier": 1,
      "education-modifier": 0,
      "career-modifier": 1
    },
    {
      "name": "Hosting a Game Night with Friends",
      "img-url": "/gamenight.png",
      "caption": "Hosting a game night with friends promises fun and laughter, but it also requires planning and preparation. Will you organize this enjoyable gathering for your friends?",
      "dilemma": "Will you organize this enjoyable gathering for your friends?",
      "physical-modifier": -1,
      "mental-modifier": 1,
      "education-modifier": 0,
      "career-modifier": 0
    },
    {
      "name": "Volunteering at a Homeless Shelter",
      "img-url": "/volunteering.png",
      "caption": "Volunteering at a homeless shelter is a compassionate act that can make a significant difference in the lives of others. It requires dedication and empathy to support those in need.",
      "dilemma": "Do you dedicate your time to volunteer at the homeless shelter?",
      "physical-modifier": -2,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": 0
    },
    {
      "name": "Losing Your Job to Artificial Intelligence",
      "img-url": "/losingjobai.png",
      "caption": "Receiving notice that your job is being automated by artificial intelligence is a shocking blow. It leaves you uncertain about your future career prospects and prompts you to reconsider your career path.",
      "dilemma": "Do you begin searching for a new job immediately?",
      "physical-modifier": 0,
      "mental-modifier": -1,
      "education-modifier": 0,
      "career-modifier": -2
    },
    {
      "name": "Escaping from a Cult",
      "img-url": "/escapecult.png",
      "caption": "Discovering that the religious group you've been a part of is actually a dangerous cult. Escaping from the compound in the mountains where they reside will be risky, but staying could have severe consequences.",
      "dilemma": "Do you attempt to escape from the cult compound?",
      "physical-modifier": 1,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": -2
    },
    {
      "name": "Following a Mysterious Stranger",
      "img-url": "/follow.png",
      "caption": "Encountering a mysterious stranger who seems to know your name is an intriguing yet unsettling experience. They claim to have important information that could change your life, but following them could lead to unknown dangers.",
      "dilemma": "Do you trust the mysterious stranger and follow them?",
      "physical-modifier": -1,
      "mental-modifier": -1,
      "education-modifier": 0,
      "career-modifier": 0
    },

    {
      "name": "Self-care",
      "img-url": "/selfcare.jpg",
      "caption": "As the weekend approached, you were excited for your self-care day with yoga, a bubble bath, and your favorite book. But then, a friend invited you to a last-minute social event. ",
      "dilemna": "Do you stick to your self-care plans??",
      "physical-modifier": 0,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": 0
    },
    {
      "name": "Family Time",
      "img-url": "/family.jpg",
      "caption": "With the weekend finally here, you had been eagerly anticipating spending quality time with your family. You had planned a day of outdoor activities and a cozy movie night together. However, just as you were about to embark on your adventure, you received an unexpected work call with a request for urgent assistance.",
      "dilemna": "Will you prioritize your family time?",
      "physical-modifier": 2,
      "mental-modifier": 1,
      "education-modifier": 0,
      "career-modifier": 0
    },
    {
      "name": "Exam",
      "img-url": "/exam.jpg",
      "caption": "You have an exam early in the morning, but you aren't fully prepared for it. As the clock ticks closer to midnight, you're faced with a decision: stay up all night to cram, or get some sleep and face the consequences in the morning.",
      "dilemna": "Will you stay up all night to study?",
      "physical-modifier":0,
      "mental-modifier": 2,
      "education-modifier": 2,
      "career-modifier": 0
    },

    {
      "name": "Volunteering",
      "img-url": "/volunteering.jpg",
      "caption": "You have committed to volunteering at a local charity event tomorrow morning, but an unexpected opportunity arises to spend the evening with friends. As you weigh your options, you realize that your decision will impact your commitment to the community and the people counting on your support.",
      "dilemna": "Will you prioritize your commitment to volunteering? ",
      "physical-modifier": 2,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": 0
    },
    
    {
      "name": "Fulfilling work commitments",
      "img-url": "/work.jpg",
      "caption": "You've been working hard on a crucial project, but your friend's birthday party is tonight. Balancing professional responsibilities and personal life, you're faced with a tough decision.",
      "dilemna": "Will you prioritize finishing your project? ",
      "physical-modifier": 0,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": 0
    },

    {
      "name": "shopping",
      "img-url": "/shopping.jpg",
      "caption": "Feeling overwhelmed, you head to the shops to relieve stress. With every purchase, the weight on your shoulders eases for a moment. But as you leave the store, you question if this temporary relief is worth the financial burden.",
      "dilemna": "Will you prioritize finishing your project? ",
      "physical-modifier": 2,
      "mental-modifier": 2,
      "education-modifier": -2,
      "career-modifier": -1
    },

    {
      "name": "Graduation",
      "img-url": "/graduation.jpg",
      "caption": " Having just graduated with your bachelor's degree, you stand at a crossroads, pondering your next move. The option to continue your studies looms large, offering paths of further specialization or advanced degrees. Yet, with the weight of uncertainty pressing down, you must decide whether to embark on this new academic journey or explore alternative paths in the workforce.",
      "dilemna": "Will you choose to continue your studies? ",
      "physical-modifier": -1,
      "mental-modifier": 1,
      "education-modifier": 2,
      "career-modifier": 2
    },

    {
      "name": "Eating healthy",
      "img-url": "/healthy.jpg",
      "caption": "Your doctor advises you to switch to a healthier diet due to health concerns, but you're hesitant to give up your favorite unhealthy foods.",
      "dilemna": "Will you make the switch to healthier eating?? ",
      "physical-modifier": 0,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": 0
    },

    {
      "name": "Traveling",
      "img-url": "/vacation.jpg",
      "caption": "You're eager to travel, but commitments keep you grounded. Do you take the leap and embark on an adventure, or stay put for now?.",
      "dilemna": "Will you travel?? ",
      "physical-modifier": 1,
      "mental-modifier": 2,
      "education-modifier": 0,
      "career-modifier": 0
    },

    {
      "name": "Hiking",
      "img-url": "/hiking.jpg",
      "caption": "Heading out on a hike brings joy and peace to your mind. With each step, stress melts away, replaced by the beauty of nature.",
      "dilemna": "Will you choose hiking? ",
      "physical-modifier": 2,
      "mental-modifier": 2,
      "education-modifier": -2,
      "career-modifier": -1
    }
  ]
}
